cask_args appdir: '/Applications'

brew 'git'

tap 'homebrew/services'

brew 'gradle'
brew 'exa'
brew 'wget'
brew 'cmake'
brew 'dnsmasq'
brew 'htop-osx'
brew 'httpie'
brew 'jq'
brew 'mercurial'
brew 'nmap'
brew 'node-build'
brew 'nodenv'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'hub'
brew 'n'
brew 'redis'
brew 'mysql@5.6'
cask 'sequel-pro'
cask 'postman'
cask 'slack'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'flux'
cask 'github'
cask 'firefox'
cask 'iterm2'
cask 'eclipse-ide'
