cask_args appdir: '/Applications'

# DO NOT INSTALL NODE THROUGH BREW - USE nodenv or some other node version manager
# brew 'node'
# brew postinstall node
# brew link node
### ^ WILL BREAK THE SCRIPT ^

# https://formulae.brew.sh/formula/awscli
brew 'awscli'
brew 'jq'

# https://formulae.brew.sh/formula/terraform
brew 'terraform'

# https://formulae.brew.sh/formula/git
brew 'git'

# https://formulae.brew.sh/formula/gh
brew 'gh'

# https://formulae.brew.sh/formula/exa#default
brew 'exa'

# https://formulae.brew.sh/formula/wget#default
brew 'wget'

# https://formulae.brew.sh/formula/nodenv#default
brew 'nodenv'

# https://formulae.brew.sh/formula/neovim#default
brew 'neovim'

# https://formulae.brew.sh/formula/task - https://github.com/go-task/homebrew-tap
brew 'go-task/tap/go-task'

# https://formulae.brew.sh/cask/postman#default
cask 'postman'

# https://formulae.brew.sh/cask/slack#default
cask 'slack'

# https://formulae.brew.sh/cask/google-chrome#default
cask 'google-chrome'

# https://vscodium.com/
cask 'vscodium'

# https://formulae.brew.sh/cask/firefox#default
cask 'firefox'

# https://formulae.brew.sh/cask/iterm2#default
cask 'iterm2'

# https://formulae.brew.sh/cask/docker#default
cask 'docker'

# https://formulae.brew.sh/cask/1password
cask '1password'

# https://formulae.brew.sh/cask/spotify
cask 'spotify'

# https://formulae.brew.sh/cask/google-cloud-sdk
cask 'google-cloud-sdk'
