cask_args appdir: '/Applications'

# DO NOT INSTALL NODE THROUGH BREW - USE nodenv
brew 'node'
brew postinstall node
brew link node

# https://formulae.brew.sh/formula/awscli
brew 'awscli'

# https://formulae.brew.sh/formula/terraform
brew 'terraform'

# https://formulae.brew.sh/formula/git
brew 'git'

# https://formulae.brew.sh/formula/exa#default
brew 'exa'

# https://formulae.brew.sh/formula/wget#default
brew 'wget'

# https://formulae.brew.sh/cask/cmake#default
brew 'cmake'

# https://formulae.brew.sh/formula/nodenv#default
brew 'nodenv'

###
# https://ffmpeg.org/ffmpeg.html
# https://www.npmjs.com/package/ffmpeg
# https://formulae.brew.sh/formula/ffmpeg
# brew 'ffmpeg'

# https://formulae.brew.sh/cask/postman#default
cask 'postman'

# https://formulae.brew.sh/cask/slack#default
cask 'slack'

# https://formulae.brew.sh/cask/google-chrome#default
cask 'google-chrome'

# https://formulae.brew.sh/cask/visual-studio-code#default
cask 'visual-studio-code'

# https://formulae.brew.sh/cask/sublime-text#default
cask 'sublime-text'

# https://formulae.brew.sh/cask/firefox#default
cask 'firefox'

# https://formulae.brew.sh/cask/iterm2#default
cask 'iterm2'

# https://formulae.brew.sh/cask/docker#default
cask 'docker'
